# EditorInteraction Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EditorInteraction Properties
EditorInteraction Class See Also
---
The EditorInteraction type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| InteractionType | The type of interaction. |

# See Also
EditorInteraction Class
Autodesk.Revit.UI Namespace